# Solución Examen UD1 - Parte 2

Si tenemos un dataframe df con columnas age, salary, sex y queremos:

1. Mostrar aquellos individuos menores de 30 años o con salario igual o superior a 25000 euros,

2. Añadir una nueva columna numérica al dataframe llamada salary_irpf que se corresponda con el 20% de su sueldo, entonces escribiremos:


3. Si tenemos un dataframe df con columnas age, salary, sex y queremos saber cuél es la media de edad de nuestros individuos, entonces escribiremos:


4. Si tenemos un dataframe df con columnas age, salary, sex y queremos borrar del mismo la columna sex, entonces escribiremos:


5. Si tenemos un dataframe df con columnas age, salary, sex y queremos conocer el salario máximo por sexo, entonces escribiremos:


6. Si tenemos un dataframe df con columnas age, salary, sex y queremos recuperar las 3 primeras filas y las 3 últimas de la columna salary en una única instrucción, entonces escribiremos:

7. Si tenemos un dataframe df con columnas age, salary, sex y queremos añadir borrar todas las filas que tengan valores nulos en la columna salary, entonces escribiremos:

In [1]:
# Importación de librerías
import pandas as pd
import numpy as np

In [5]:
# Cargar DataFrame
df = pd.read_csv('data/demo-examen-parte2.csv')

In [17]:
# Ejercicio 1
df[(df['age'] > 30) | (df['salary'] >= 25000)]

   age  salary     sex
0   58   36000    male
2   31   23000  female
3   28   40000  female
4   46   50000    male
6   38   38000  female
7   40   29000    male

In [21]:
# Ejercicio 2
df['salary_irpf'] = 0.20 * df['salary']
df

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0

In [25]:
# Ejercicio 3
df['age'].mean()

35.25

In [30]:
# Ejercicio 4
df.drop('age', axis=1)

   salary     sex  salary_irpf
0   36000    male       7200.0
1   18000  female       3600.0
2   23000  female       4600.0
3   40000  female       8000.0
4   50000    male      10000.0
5   15000    male       3000.0
6   38000  female       7600.0
7   29000    male       5800.0

In [36]:
# Ejercicio 5
df.groupby('sex').max()['salary']

sex
female    40000
male      50000
Name: salary, dtype: int64

In [54]:
# Ejercicio 6
df['salary']

0    36000
3    40000
6    38000
Name: salary, dtype: int64

In [43]:
# Ejercicio 7
df.dropna( subset='salary')

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0